/* In this.pixelgrid/index.js

██████  ██ ██   ██ ███████ ██       ██████  ██████  ██ ██████     ███    ███ ███████ 
██   ██ ██  ██ ██  ██      ██      ██       ██   ██ ██ ██   ██    ████  ████ ██      
██████  ██   ███   █████   ██      ██   ███ ██████  ██ ██   ██    ██ ████ ██ █████   
██      ██  ██ ██  ██      ██      ██    ██ ██   ██ ██ ██   ██    ██  ██  ██ ██      
██      ██ ██   ██ ███████ ███████  ██████  ██   ██ ██ ██████  ██ ██      ██ ███████                                                                                                                                                                     
ⓝⓔⓤⓡⓞⓝⓢ.ⓜⓔ
🆂🆄🅸🅶🅽 */
/**
 * @module pixelgrid
 * @description Exports the main functionalities of the this.pixelgrid library.
 */

import PixelGridClass from './src/PixelGrid.js';

/**
 * The main export object of this.pixelgrid package.
 * @type {Object}
 */
const PixelGrid = {
  PixelGridclass
};

export default PixelGrid;

console.log("PixelGrid loaded;");
